petstore_backend/app/services/authentication_services/authenticate_user_action.rb

    promises :user

    executed do |context|
      user = User.find_by_email context.email
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "saad.18@gmail.com"], ["LIMIT", 1]]