petstore_backend/app/services/authentication_services/get_user_action.rb

    promises :user

    executed do |context|
      user = User.find_by(id: context.decoded_auth_token[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]